<?php


class Translite
{
    public function cyrillic($slug)
    {
        $iso9_table = [
            'А' => 'a', 'Б' => 'b', 'В' => 'v', 'Г' => 'g', 'Ѓ' => 'g',
            'Ґ' => 'g', 'Д' => 'd', 'Е' => 'e', 'Ё' => 'yo', 'Є' => 'ye',
            'Ж' => 'zh', 'З' => 'z', 'Ѕ' => 'z', 'И' => 'i', 'Й' => 'j',
            'Ј' => 'j', 'І' => 'i', 'Ї' => 'yi', 'К' => 'k', 'Ќ' => 'k',
            'Л' => 'l', 'Љ' => 'l', 'М' => 'm', 'Н' => 'n', 'Њ' => 'n',
            'О' => 'o', 'П' => 'p', 'Р' => 'r', 'С' => 's', 'Т' => 't',
            'У' => 'u', 'Ў' => 'u', 'Ф' => 'f', 'Х' => 'h', 'Ц' => 'ts',
            'Ч' => 'ch', 'Џ' => 'dh', 'Ш' => 'sh', 'Щ' => 'shh', 'Ъ' => '',
            'Ы' => 'y', 'Ь' => '', 'Э' => 'e', 'Ю' => 'yu', 'Я' => 'ya',
            'а' => 'a', 'б' => 'b', 'в' => 'v', 'г' => 'g', 'ѓ' => 'g',
            'ґ' => 'g', 'д' => 'd', 'е' => 'e', 'ё' => 'yo', 'є' => 'ye',
            'ж' => 'zh', 'з' => 'z', 'ѕ' => 'z', 'и' => 'i', 'й' => 'j',
            'ј' => 'j', 'і' => 'i', 'ї' => 'yi', 'к' => 'k', 'ќ' => 'k',
            'л' => 'l', 'љ' => 'l', 'м' => 'm', 'н' => 'n', 'њ' => 'n',
            'о' => 'o', 'п' => 'p', 'р' => 'r', 'с' => 's', 'т' => 't',
            'у' => 'u', 'ў' => 'u', 'ф' => 'f', 'х' => 'h', 'ц' => 'ts',
            'ч' => 'ch', 'џ' => 'dh', 'ш' => 'sh', 'щ' => 'shh', 'ъ' => '',
            'ы' => 'y', 'ь' => '', 'э' => 'e', 'ю' => 'yu', 'я' => 'ya'
        ];
        $name = strtr($slug, $iso9_table);
        $name = preg_replace('~[^A-Za-z0-9\'_\-\.]~', '-', $name);
        $name = preg_replace('~\-+~', '-', $name); // --- на -
        $name = preg_replace('~^-+|-+$~', '', $name); // кил - на концах
        return $name;
    }

}